{"keras_version": "2.0.9", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [2, 2], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": false, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [3, 3]}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "filters": 80, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "filters": 192, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": false, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [3, 3]}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_9"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 48, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 96, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_7"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_10"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "trainable": false, "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_1", "pool_size": [3, 3]}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 96, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_6"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_8"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_11"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_12"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "trainable": false, "name": "mixed0"}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_16", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_16", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_16"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 48, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_14", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 96, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_17", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_14", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_17", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_14"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_17"}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "trainable": false, "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_2", "pool_size": [3, 3]}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_13", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_15", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 96, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_18", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_19", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_13", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_15", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_18", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_19", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_13"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_15"}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_18"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_19"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "trainable": false, "name": "mixed1"}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_23", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_23", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_23"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 48, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_21", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 96, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_24", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_21", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_24", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_21"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_24"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"strides": [1, 1], "trainable": false, "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_3", "pool_size": [3, 3]}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_20", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_22", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 96, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_25", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_26", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_20", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_22", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_25", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_26", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_20"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_22"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_25"}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_26"}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "trainable": false, "name": "mixed2"}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_28", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_28", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_28"}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 96, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_29", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_29", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_29"}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "filters": 384, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [2, 2], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_27", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "filters": 96, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [2, 2], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_30", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_27", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_30", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_27"}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_30"}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": false, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [3, 3]}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 3, "trainable": false, "name": "mixed3"}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_35", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_35", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_35"}, "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [7, 1], "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": false, "kernel_constraint": null, "strides": [1, 1], "trainable": false, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_36", "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 3, "gamma_constraint": null, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "scale": false, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_36", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "activation_36"}, "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 