{"keras_version": "2.0.9", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_1", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "strides": [2, 2], "padding": "valid", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": false}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_2", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "strides": [1, 1], "padding": "valid", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": false}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_3", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": false}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_4", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 80, "strides": [1, 1], "padding": "valid", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": false}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_5", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 192, "strides": [1, 1], "padding": "valid", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": false}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"pool_size": [3, 3], "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_9", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "trainable": false}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_7", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 48, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_10", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "trainable": false}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "trainable": false}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"pool_size": [3, 3], "name": "average_pooling2d_1", "data_format": "channels_last", "strides": [1, 1], "padding": "same", "trainable": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_6", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_8", "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_11", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_12", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": false}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "trainable": false}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "trainable": false}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "trainable": false}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed0", "config": {"name": "mixed0", "axis": 3, "trainable": false}, "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_16", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"name": "batch_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"activation": "relu", "name": "activation_16", "trainable": false}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_14", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 48, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_17", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"name": "batch_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"activation": "relu", "name": "activation_14", "trainable": false}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"activation": "relu", "name": "activation_17", "trainable": false}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"pool_size": [3, 3], "name": "average_pooling2d_2", "data_format": "channels_last", "strides": [1, 1], "padding": "same", "trainable": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_13", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_15", "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_18", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_19", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"name": "batch_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"name": "batch_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"name": "batch_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"activation": "relu", "name": "activation_13", "trainable": false}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"activation": "relu", "name": "activation_15", "trainable": false}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"activation": "relu", "name": "activation_18", "trainable": false}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"activation": "relu", "name": "activation_19", "trainable": false}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed1", "config": {"name": "mixed1", "axis": 3, "trainable": false}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_23", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"name": "batch_normalization_23", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_23", "config": {"activation": "relu", "name": "activation_23", "trainable": false}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_21", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 48, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_24", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"name": "batch_normalization_21", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"name": "batch_normalization_24", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_21", "config": {"activation": "relu", "name": "activation_21", "trainable": false}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_24", "config": {"activation": "relu", "name": "activation_24", "trainable": false}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "config": {"pool_size": [3, 3], "name": "average_pooling2d_3", "data_format": "channels_last", "strides": [1, 1], "padding": "same", "trainable": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_20", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_22", "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_25", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_26", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_26", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"name": "batch_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"name": "batch_normalization_22", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"name": "batch_normalization_25", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"name": "batch_normalization_26", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"activation": "relu", "name": "activation_20", "trainable": false}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_22", "config": {"activation": "relu", "name": "activation_22", "trainable": false}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_25", "config": {"activation": "relu", "name": "activation_25", "trainable": false}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_26", "config": {"activation": "relu", "name": "activation_26", "trainable": false}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed2", "config": {"name": "mixed2", "axis": 3, "trainable": false}, "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_28", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_28", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"name": "batch_normalization_28", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_28", "config": {"activation": "relu", "name": "activation_28", "trainable": false}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_29", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_29", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"name": "batch_normalization_29", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_29", "config": {"activation": "relu", "name": "activation_29", "trainable": false}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_27", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_27", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 384, "strides": [2, 2], "padding": "valid", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_30", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_30", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "filters": 96, "strides": [2, 2], "padding": "valid", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"name": "batch_normalization_27", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"name": "batch_normalization_30", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_27", "config": {"activation": "relu", "name": "activation_27", "trainable": false}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_30", "config": {"activation": "relu", "name": "activation_30", "trainable": false}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"pool_size": [3, 3], "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed3", "config": {"name": "mixed3", "axis": 3, "trainable": false}, "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_35", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_35", "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 128, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"name": "batch_normalization_35", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_35", "config": {"activation": "relu", "name": "activation_35", "trainable": false}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_36", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_36", "kernel_size": [7, 1], "kernel_regularizer": null, "data_format": "channels_last", "filters": 128, "strides": [1, 1], "padding": "same", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": false}, "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"name": "batch_normalization_36", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "scale": false, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_36", "config": {"activation": "relu", "name": "activation_36", "trainable": false}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_32", "config": 