{"backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, null, null, 3]}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_1", "activation": "linear", "strides": [2, 2], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 32, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": false}}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_2", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 32, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": false}}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_3", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": false}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false, "pool_size": [3, 3]}}, {"name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_4", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 80, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": false}}, {"name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_5", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 192, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": false}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false, "pool_size": [3, 3]}}, {"name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_9", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": false}}, {"name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_7", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 48, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_10", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 96, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": false}}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": false}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "data_format": "channels_last", "strides": [1, 1], "padding": "same", "trainable": false, "pool_size": [3, 3]}}, {"name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_6", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_8", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_11", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 96, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_12", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 32, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": false}}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": false}}, {"name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": false}}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": false}}, {"name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed0", "trainable": false, "axis": 3}}, {"name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_16", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "trainable": false}}, {"name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_14", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 48, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_17", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 96, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": false}}, {"name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_17", "activation": "relu", "trainable": false}}, {"name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "data_format": "channels_last", "strides": [1, 1], "padding": "same", "trainable": false, "pool_size": [3, 3]}}, {"name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_13", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_15", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_18", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 96, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_19", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": false}}, {"name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "trainable": false}}, {"name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_18", "activation": "relu", "trainable": false}}, {"name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_19", "activation": "relu", "trainable": false}}, {"name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed1", "trainable": false, "axis": 3}}, {"name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_23", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_23", "activation": "relu", "trainable": false}}, {"name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_21", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 48, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_24", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 96, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_24", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_21", "activation": "relu", "trainable": false}}, {"name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_24", "activation": "relu", "trainable": false}}, {"name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "data_format": "channels_last", "strides": [1, 1], "padding": "same", "trainable": false, "pool_size": [3, 3]}}, {"name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_20", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_22", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_25", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 96, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_26", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_25", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_20", "activation": "relu", "trainable": false}}, {"name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_22", "activation": "relu", "trainable": false}}, {"name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_25", "activation": "relu", "trainable": false}}, {"name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_26", "activation": "relu", "trainable": false}}, {"name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed2", "trainable": false, "axis": 3}}, {"name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_28", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 64, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_28", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_28", "activation": "relu", "trainable": false}}, {"name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_29", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 96, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_29", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_29", "activation": "relu", "trainable": false}}, {"name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_27", "activation": "linear", "strides": [2, 2], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 384, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_30", "activation": "linear", "strides": [2, 2], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 96, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_27", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_30", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_27", "activation": "relu", "trainable": false}}, {"name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_30", "activation": "relu", "trainable": false}}, {"name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false, "pool_size": [3, 3]}}, {"name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "mixed3", "trainable": false, "axis": 3}}, {"name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_35", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 128, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_35", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_35", "activation": "relu", "trainable": false}}, {"name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_36", "activation": "linear", "strides": [1, 1], "use_bias": false, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [7, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "trainable": false, "filters": 128, "bias_constraint": null, "kernel_regularizer": null}}, {"name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_36", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_regularizer": null, "scale": false, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "center": true, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}}, {"name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_36", "activation": "relu", "trainable": false}}, {"name": 