{"keras_version": "2.0.9", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, null, null, 3], "dtype": "float32"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [2, 2], "filters": 32, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_1", "beta_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_2", "beta_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_3", "beta_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": false, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [3, 3]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 80, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_4", "beta_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_5", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 192, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_5", "beta_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": false, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [3, 3]}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_9", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_9", "beta_constraint": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_7", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 48, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_10", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 96, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_7", "beta_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_10", "beta_constraint": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "trainable": false, "padding": "same", "strides": [1, 1], "name": "average_pooling2d_1", "pool_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_6", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_8", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_11", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 96, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_12", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_6", "beta_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_8", "beta_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_11", "beta_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_12", "beta_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "mixed0", "class_name": "Concatenate", "config": {"name": "mixed0", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_16", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_16", "beta_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_14", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 48, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_17", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 96, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_14", "beta_constraint": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_17", "beta_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "trainable": false, "padding": "same", "strides": [1, 1], "name": "average_pooling2d_2", "pool_size": [3, 3]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_13", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_15", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_18", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 96, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_19", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_13", "beta_constraint": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_15", "beta_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_18", "beta_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_19", "beta_constraint": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "mixed1", "class_name": "Concatenate", "config": {"name": "mixed1", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_23", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_23", "beta_constraint": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_21", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 48, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_24", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 96, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_21", "beta_constraint": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_24", "beta_constraint": null}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "trainable": false, "padding": "same", "strides": [1, 1], "name": "average_pooling2d_3", "pool_size": [3, 3]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_20", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_22", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_25", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 96, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_26", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_20", "beta_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_22", "beta_constraint": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_25", "beta_constraint": null}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_26", "beta_constraint": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"name": "mixed2", "class_name": "Concatenate", "config": {"name": "mixed2", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_28", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_28", "beta_constraint": null}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "activation_28", "class_name": "Activation", "config": {"name": "activation_28", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_29", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 96, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_29", "beta_constraint": null}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "activation_29", "class_name": "Activation", "config": {"name": "activation_29", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_27", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [2, 2], "filters": 384, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_30", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [2, 2], "filters": 96, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_27", "beta_constraint": null}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_30", "beta_constraint": null}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"name": "activation_27", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"name": "activation_30", "class_name": "Activation", "config": {"name": "activation_30", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": false, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [3, 3]}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "mixed3", "class_name": "Concatenate", "config": {"name": "mixed3", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_35", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_35", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_35", "beta_constraint": null}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"name": "activation_35", "class_name": "Activation", "config": {"name": "activation_35", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"name": "conv2d_36", "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [7, 1], "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_36", "use_bias": false, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": false, "axis": 3, "momentum": 0.99, "name": "batch_normalization_36", "beta_constraint": null}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"name": "activation_36", "class_name": "Activation", "config": {"name": "activation_36", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": 