{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 32, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "valid", "use_bias": false}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_1", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": false}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 32, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "valid", "use_bias": false}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_2", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": false}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": false}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_3", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": false}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_1", "trainable": false, "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 80, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "valid", "use_bias": false}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_4", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": false}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 192, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "valid", "use_bias": false}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_5", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": false}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_2", "trainable": false, "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_9", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": false}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 48, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 96, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": false}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_7", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_10", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": false}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": false}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "strides": [1, 1], "name": "average_pooling2d_1", "trainable": false, "padding": "same", "data_format": "channels_last"}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [5, 5], "padding": "same", "use_bias": false}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 96, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": false}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 32, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_6", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_8", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_11", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_12", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": false}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": false}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": false}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": false}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed0", "trainable": false, "axis": 3}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_16", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_16", "trainable": false}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 48, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 96, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": false}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_14", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_17", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": false}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_17", "trainable": false}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "strides": [1, 1], "name": "average_pooling2d_2", "trainable": false, "padding": "same", "data_format": "channels_last"}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [5, 5], "padding": "same", "use_bias": false}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 96, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": false}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_13", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_15", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_18", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_19", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": false}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_15", "trainable": false}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_18", "trainable": false}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_19", "trainable": false}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed1", "trainable": false, "axis": 3}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_23", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_23", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_23", "trainable": false}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 48, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_21", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 96, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_24", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": false}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_21", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_24", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_21", "trainable": false}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_24", "trainable": false}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "strides": [1, 1], "name": "average_pooling2d_3", "trainable": false, "padding": "same", "data_format": "channels_last"}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_22", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [5, 5], "padding": "same", "use_bias": false}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 96, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_25", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": false}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_26", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_20", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_22", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_25", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_26", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_20", "trainable": false}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_22", "trainable": false}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_25", "trainable": false}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_26", "trainable": false}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed2", "trainable": false, "axis": 3}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_28", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_28", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_28", "trainable": false}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 96, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_29", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": false}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_29", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_29", "trainable": false}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 384, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_27", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "valid", "use_bias": false}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 96, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_30", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "valid", "use_bias": false}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_27", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_30", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_27", "trainable": false}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_30", "trainable": false}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_3", "trainable": false, "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed3", "trainable": false, "axis": 3}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 128, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_35", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "use_bias": false}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_35", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_35", "trainable": false}, "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "activation": "linear", "data_format": "channels_last", "filters": 128, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_36", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_size": [7, 1], "padding": "same", "use_bias": false}, "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_36", "epsilon": 0.001, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_regularizer": null}, "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_36", "trainable": false}, "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "Conv2D", 