{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_1"}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_1"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"config": {"trainable": false, "name": "activation_1", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_2"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_2"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"config": {"trainable": false, "name": "activation_2", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_3"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_3"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"config": {"trainable": false, "name": "activation_3", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3"}, {"config": {"name": "max_pooling2d_1", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_4"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_4"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"config": {"trainable": false, "name": "activation_4", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_5"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_5"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"config": {"trainable": false, "name": "activation_5", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5"}, {"config": {"name": "max_pooling2d_2", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_9"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_9"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9"}, {"config": {"trainable": false, "name": "activation_9", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_7"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_10"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_7"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_10"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10"}, {"config": {"trainable": false, "name": "activation_7", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7"}, {"config": {"trainable": false, "name": "activation_10", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10"}, {"config": {"name": "average_pooling2d_1", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "trainable": false}, "class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_6"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [5, 5], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_8"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_11"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_12"}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_6"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_8"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_11"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_12"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12"}, {"config": {"trainable": false, "name": "activation_6", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6"}, {"config": {"trainable": false, "name": "activation_8", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8"}, {"config": {"trainable": false, "name": "activation_11", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11"}, {"config": {"trainable": false, "name": "activation_12", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12"}, {"config": {"axis": 3, "trainable": false, "name": "mixed0"}, "class_name": "Concatenate", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "name": "mixed0"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_16"}, "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_16"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_16"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16"}, {"config": {"trainable": false, "name": "activation_16", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_14"}, "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_14"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_17"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_14"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_17"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17"}, {"config": {"trainable": false, "name": "activation_14", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14"}, {"config": {"trainable": false, "name": "activation_17", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17"}, {"config": {"name": "average_pooling2d_2", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "trainable": false}, "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_2"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_13"}, "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_13"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [5, 5], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_15"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_18"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_19"}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_19"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_13"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_15"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_18"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_19"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19"}, {"config": {"trainable": false, "name": "activation_13", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13"}, {"config": {"trainable": false, "name": "activation_15", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "activation_15"}, {"config": {"trainable": false, "name": "activation_18", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18"}, {"config": {"trainable": false, "name": "activation_19", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19"}, {"config": {"axis": 3, "trainable": false, "name": "mixed1"}, "class_name": "Concatenate", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "mixed1"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_23"}, "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_23"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_23"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23"}, {"config": {"trainable": false, "name": "activation_23", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_21"}, "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_21"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_24"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_21"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_24"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24"}, {"config": {"trainable": false, "name": "activation_21", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21"}, {"config": {"trainable": false, "name": "activation_24", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24"}, {"config": {"name": "average_pooling2d_3", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "trainable": false}, "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_3"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_20"}, "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_20"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [5, 5], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_22"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_22"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_25"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_25"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_26"}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_26"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_20"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_22"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_25"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_26"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26"}, {"config": {"trainable": false, "name": "activation_20", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20"}, {"config": {"trainable": false, "name": "activation_22", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22"}, {"config": {"trainable": false, "name": "activation_25", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "name": "activation_25"}, {"config": {"trainable": false, "name": "activation_26", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "activation_26"}, {"config": {"axis": 3, "trainable": false, "name": "mixed2"}, "class_name": "Concatenate", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "name": "mixed2"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_28"}, "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_28"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_28"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28"}, {"config": {"trainable": false, "name": "activation_28", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "activation_28"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_29"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_29"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29"}, {"config": {"trainable": false, "name": "activation_29", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "activation_29"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_27"}, "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_27"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_30"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_30"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_27"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_30"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30"}, {"config": {"trainable": false, "name": "activation_27", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "name": "activation_27"}, {"config": {"trainable": false, "name": "activation_30", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "name": "activation_30"}, {"config": {"name": "max_pooling2d_3", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": false}, "class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"config": {"axis": 3, "trainable": false, "name": "mixed3"}, "class_name": "Concatenate", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "mixed3"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_35"}, "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_35"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_35"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "name": "batch_normalization_35"}, {"config": {"trainable": false, "name": "activation_35", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "name": "activation_35"}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": false, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": false, "activation": "linear", "kernel_size": [7, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_36"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "name": "conv2d_36"}, {"config": {"epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": false, "scale": false, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_36"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "name": "batch_normalization_36"}, {"config": {"trainable": false, "name": "activation_36", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "name": "activation_36"}, {"config": {"kernel_initializer": {"class_name": 