{"keras_version": "2.0.9", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 32, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [2, 2], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_1", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 32, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_2", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_3", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "trainable": false, "pool_size": [3, 3], "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 80, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_4", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 192, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_5", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_5", "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "trainable": false, "pool_size": [3, 3], "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_9", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_9", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 48, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 96, "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_7", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_10", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_7", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_10", "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "trainable": false, "pool_size": [3, 3], "name": "average_pooling2d_1", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [5, 5], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 96, "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 32, "name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_6", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_8", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_11", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_12", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_6", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_8", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_11", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_12", "activation": "relu"}}, {"class_name": "Concatenate", "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"trainable": false, "name": "mixed0", "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_16", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_16", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_16", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 48, "name": "conv2d_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 96, "name": "conv2d_17", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_14", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_17", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_14", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_17", "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "trainable": false, "pool_size": [3, 3], "name": "average_pooling2d_2", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [5, 5], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 96, "name": "conv2d_18", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_19", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_13", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_15", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_18", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_19", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_13", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_15", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_18", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_19", "activation": "relu"}}, {"class_name": "Concatenate", "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"trainable": false, "name": "mixed1", "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_23", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_23", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_23", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 48, "name": "conv2d_21", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 96, "name": "conv2d_24", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_21", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_24", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_21", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_24", "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "trainable": false, "pool_size": [3, 3], "name": "average_pooling2d_3", "strides": [1, 1]}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_20", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_22", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [5, 5], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 96, "name": "conv2d_25", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_26", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_20", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_22", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_25", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_26", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_20", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_22", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_25", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_26", "activation": "relu"}}, {"class_name": "Concatenate", "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"trainable": false, "name": "mixed2", "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "name": "conv2d_28", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_28", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_28", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 96, "name": "conv2d_29", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_29", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_29", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 384, "name": "conv2d_27", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [2, 2], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 96, "name": "conv2d_30", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [2, 2], "use_bias": false, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_27", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_30", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_27", "activation": "relu"}}, {"class_name": "Activation", "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_30", "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "trainable": false, "pool_size": [3, 3], "name": "max_pooling2d_3", "strides": [2, 2]}}, {"class_name": "Concatenate", "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"trainable": false, "name": "mixed3", "axis": 3}}, {"class_name": "Conv2D", "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 128, "name": "conv2d_35", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_35", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"trainable": false, "name": "activation_35", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 128, "name": "conv2d_36", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "bias_constraint": null, "kernel_size": [7, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_36", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"trainable": false, "name": 